# DataFrames II

In [3]:
import numpy as np

In [4]:
import pandas as pd

In [5]:
from numpy.random import randn

In [6]:
np.random.seed(101)

In [7]:
df = pd.DataFrame(randn(5,4), index = 'a b c d e'.split(), columns='w x y z'.split())

In [8]:
df # indexing rows with condition

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [25]:
dfa = pd.DataFrame(np.arange(1,21).reshape(5,4), index = 'a b c d e'.split(), columns = 'w x y z'.split())
dfa

    w   x   y   z
a   1   2   3   4
b   5   6   7   8
c   9  10  11  12
d  13  14  15  16
e  17  18  19  20

In [61]:
dfa[dfa>12]
dfa.loc[['d'],["w"]]

d    13
Name: w, dtype: int32

In [24]:
dfa[dfa>6].loc[["a","c"]] #[["w","x"]

     w     x     y     z
a  NaN   NaN   NaN   NaN
c  9.0  10.0  11.0  12.0

In [8]:
dfa[dfa["w"]==5]["w"]

b    5
Name: w, dtype: int32

In [23]:
dfa[dfa.loc["d"]>13]

J:\Python\lib\site-packages\ipykernel_launcher.py:1: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  """Entry point for launching an IPython kernel.

IndexingError: Unalignable boolean Series provided as indexer (index of the boolean Series and of the indexed object do not match

In [16]:
#df[(df['w']>0)|(df['y']>0)]
df
df[(df["w"]>0)&(df['y']>2)]

          w         x         y         z
e  0.190794  1.978757  2.605967  0.683509

In [23]:
df[df['w']< 2.706]

          w         x         y         z
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

# Conditional Selection
An important feature of pandas is conditional selection using bracket notation, very similar to numpy:

In [7]:
# let's see different exmaples of conditional selection

In [13]:
df[df['w']>0]


# this will output the series with all the rows where value of the column 'W' is greater than 0 in boolean form meani
# true false

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [39]:
#df[df["w"]>0][['x','y']]
a = df[df['w']>0]
a[['x','y']]

          x         y
a  0.628133  0.907969
b -0.319318 -0.848077
d -0.758872 -0.933237
e  1.978757  2.605967

In [53]:
bool1 = df['w']>0

In [54]:
df[bool1]# we can see it gave the dataframe and removed the all the row entries where 'w' was less than 0

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
d  0.188695 -0.758872 -0.933237  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [55]:
df[bool1][['w','y']] # this is how we can get only w column out of this result

          w         y
a  2.706850  0.907969
b  0.651118 -0.848077
d  0.188695 -0.933237
e  0.190794  2.605967

In [15]:
df[bool1][['w','x']]

          w         x
a  2.706850  0.628133
b  0.651118 -0.319318
d  0.188695 -0.758872
e  0.190794  1.978757

In [16]:
acc = df[bool1][['w','x']]

In [17]:
acc.loc[['a','b']]

          w         x
a  2.706850  0.628133
b  0.651118 -0.319318

In [18]:
# Let us try to apply conditional selection on the whole dataframe

In [40]:
df>0

       w      x      y      z
a   True   True   True   True
b   True  False  False   True
c  False   True   True  False
d   True  False  False   True
e   True   True   True   True

In [41]:
df[df>0] # this is how you can get the values

          w         x         y         z
a  2.706850  0.628133  0.907969  0.503826
b  0.651118       NaN       NaN  0.605965
c       NaN  0.740122  0.528813       NaN
d  0.188695       NaN       NaN  0.955057
e  0.190794  1.978757  2.605967  0.683509

In [21]:
# for multiple conditions we have to use '&' for 'and' AND for 'or' we should use '|'. let's see some examples

In [43]:
a = [[1,2,3],[4,5,6],[7,8,9]]

In [45]:
df33=pd.DataFrame( a ,index = 'w x y'.split(), columns= 'a b c'.split())

In [49]:
df33[(df33['a']>4) & (df33['c']==9)]

   a  b  c
y  7  8  9

In [14]:
df[(df['w']>0.2) & (df['y']>0.5)]

         w         x         y         z
a  2.70685  0.628133  0.907969  0.503826

In [19]:
df[(df['w']>0.2) & (df['y']>0.5)][['w','y']] # thats the way to do it

         w         y
a  2.70685  0.907969

In [24]:
# Let's discuss some more features of indexing, including resetting the index or setting it something else. 
#We'll also talk about index hierarchy!

In [24]:
df.reset_index() # before our index was 'a,b,c,d,e now with reset index option we can reset it again [0,1,2,3,4]

  index         w         x         y         z
0     a  2.706850  0.628133  0.907969  0.503826
1     b  0.651118 -0.319318 -0.848077  0.605965
2     c -2.018168  0.740122  0.528813 -0.589001
3     d  0.188695 -0.758872 -0.933237  0.955057
4     e  0.190794  1.978757  2.605967  0.683509

In [25]:
# we can even set entrirely new index let's see how can we do that 
new_index = 'uk us ussr italy japan'.split()

In [26]:
new_index

['uk', 'us', 'ussr', 'italy', 'japan']

In [27]:
df['country']= new_index

In [28]:
df

          w         x         y         z country
a  2.706850  0.628133  0.907969  0.503826      uk
b  0.651118 -0.319318 -0.848077  0.605965      us
c -2.018168  0.740122  0.528813 -0.589001    ussr
d  0.188695 -0.758872 -0.933237  0.955057   italy
e  0.190794  1.978757  2.605967  0.683509   japan

In [29]:
df.set_index('country')

                w         x         y         z
country
uk       2.706850  0.628133  0.907969  0.503826
us       0.651118 -0.319318 -0.848077  0.605965
ussr    -2.018168  0.740122  0.528813 -0.589001
italy    0.188695 -0.758872 -0.933237  0.955057
japan    0.190794  1.978757  2.605967  0.683509

# some more operation on dataframe indexing

In [30]:
data = {'name': ['Jason', 'Molly', 'Tina', 'Jake', 'Amy'], 
        'year': [2012, 2012, 2013, 2014, 2014], 
        'reports': [4, 24, 31, 2, 3],
        'coverage': [25, 94, 57, 62, 70]}
df2 = pd.DataFrame(data, index = ['Cochice', 'Pima', 'Santa Cruz', 'Maricopa', 'Yuma'])
df2

             name  year  reports  coverage
Cochice     Jason  2012        4        25
Pima        Molly  2012       24        94
Santa Cruz   Tina  2013       31        57
Maricopa     Jake  2014        2        62
Yuma          Amy  2014        3        70

In [31]:
df2.loc[['Yuma','Maricopa'],['coverage','year']]

          coverage  year
Yuma            70  2014
Maricopa        62  2014

In [33]:
bool2 = df2[df2 >15]

In [34]:
bool2

             name  year  reports  coverage
Cochice     Jason  2012      NaN        25
Pima        Molly  2012     24.0        94
Santa Cruz   Tina  2013     31.0        57
Maricopa     Jake  2014      NaN        62
Yuma          Amy  2014      NaN        70

In [33]:
bool2.loc[['Pima','Santa Cruz'],['coverage','year']]

            coverage  year
Pima              94  2012
Santa Cruz        57  2013

# Practice Important conditional selection

In [35]:
df

          w         x         y         z country
a  2.706850  0.628133  0.907969  0.503826      uk
b  0.651118 -0.319318 -0.848077  0.605965      us
c -2.018168  0.740122  0.528813 -0.589001    ussr
d  0.188695 -0.758872 -0.933237  0.955057   italy
e  0.190794  1.978757  2.605967  0.683509   japan

In [42]:
resfst = df['w']>0
ressec = df[df['w']>0]
cols = ['x','z']
ressec[cols]

          x         z
a  0.628133  0.503826
b -0.319318  0.605965
d -0.758872  0.955057
e  1.978757  0.683509

a     True
b     True
c    False
d     True
e     True
Name: w, dtype: bool

In [ ]:
df.